//==============================================================
// emulator.c
//
// CG_MCE v0.1
//
// Демонстрация:
//     - ANSI палитры
//     - окон
//     - текстовых меток
//     - вывода регистров
//
//==============================================================

#include <stdio.h>

#include "ansi_formatting.h"
#include "ui_console.h"

//==============================================================
// Точка входа
//==============================================================

int main(void)
{
    //==========================================================
    // Инициализация ANSI
    //==========================================================

    ansi_init();

    ansi_set_bg_color(ANSI_BG_BLACK);

    //==========================================================
    // Главное окно
    //==========================================================

    UI_Window main_window =
    {
        1,
        1,

        82,
        30,

        "CG_MCE v0.1"
    };

    //==========================================================
    // Окно экрана (консоль) эмулятора
    //==========================================================
    UI_Window Monitor_window =
    {
    	2,
    	2,
    	30,
    	20,
    	"Monitor"
    };

    //==========================================================
    // Окно регистров
    //==========================================================

    UI_Window reg_window =
    {
        32,
        2,

        50,
        20,

        "REGISTERS"
    };


    //==========================================================
    // Окно флагов
    //==========================================================
    

    //==========================================================
    // Окно памяти
    //==========================================================

    UI_Window memory_window =
    {
        42,
        2,

       40,
        15,

        "MEMORY MAP"
    };

    //==========================================================
    // Окно логов
    //==========================================================


     //==========================================================
    // командная строка
    //==========================================================





    //==========================================================
    // Цвет рамок
    //==========================================================

    ansi_set_text_color(ANSI_FG_BRIGHT_BLUE);

    ui_draw_window(&main_window);
    ui_draw_window(&Monitor_window);
//    ui_draw_window(&reg_window);
    ui_draw_window(&memory_window);

    //==========================================================
    // Цвет заголовков
    //==========================================================

    ansi_set_text_color(ANSI_FG_BRIGHT_CYAN);

    ui_draw_title(
        main_window.x,
        main_window.y,
        main_window.title
    );

    ui_draw_title(
    	Monitor_window.x,
    	Monitor_window.y,
    	Monitor_window.title
    );
/*
    ui_draw_title(
        reg_window.x,
        reg_window.y,
        reg_window.title
    );
*/
    ui_draw_title(
        memory_window.x,
        memory_window.y,
        memory_window.title
    );

    //==========================================================
    // Метки регистров
    //==========================================================

    UI_Label reg_ax =
    {
        "AX",
        "AX: 1F20",
        4,
        5
    };

    UI_Label reg_bx =
    {
        "BX",
        "BX: 00FF",
        4,
        6
    };

    UI_Label reg_cx =
    {
        "CX",
        "CX: A012",
        4,
        7
    };

    UI_Label reg_dx =
    {
        "DX",
        "DX: 7C00",
        4,
        8
    };

    UI_Label reg_pc =
    {
        "PC",
        "PC: 0100",
        4,
        10
    };

    UI_Label reg_sp =
    {
        "SP",
        "SP: FFFE",
        4,
        11
    };

    //==========================================================
    // Цвет регистров
    //==========================================================

    ansi_set_text_color(ANSI_FG_BRIGHT_WHITE);

    ui_draw_label(&reg_ax);
    ui_draw_label(&reg_bx);
    ui_draw_label(&reg_cx);
    ui_draw_label(&reg_dx);
    ui_draw_label(&reg_pc);
    ui_draw_label(&reg_sp);

    //==========================================================
    // Memory map
    //==========================================================

    ansi_set_text_color(ANSI_FG_BRIGHT_YELLOW);

    ui_set_cursor(30, 5);
    printf("0000-03FF");

    ui_set_cursor(30, 6);
    printf("0400-07FF");

    ui_set_cursor(30, 7);
    printf("0800-0BFF");

    ui_set_cursor(30, 8);
    printf("0C00-0FFF");

    //==========================================================
    // Тип памяти
    //==========================================================

    ansi_set_text_color(ANSI_FG_BRIGHT_WHITE);

    ui_set_cursor(44, 5);
    printf("RAM");

    ansi_set_text_color(ANSI_FG_BRIGHT_MAGENTA);

    ui_set_cursor(44, 6);
    printf("VIDEO");

    ansi_set_text_color(ANSI_FG_BRIGHT_CYAN);

    ui_set_cursor(44, 7);
    printf("ROM");

    ansi_set_text_color(ANSI_FG_BRIGHT_BLACK);

    ui_set_cursor(44, 8);
    printf("UNMAPPED");

    //==========================================================
    // Строка статуса
    //==========================================================

    ansi_set_text_color(ANSI_FG_BRIGHT_GREEN);

    ui_set_cursor(3, 22);
    printf("SYSTEM STATUS : RUNNING");

    ansi_set_text_color(ANSI_FG_BRIGHT_MAGENTA);

    ui_set_cursor(45, 22);
    printf("CLOCK : 4 MHz");

    //==========================================================
    // Возврат цветов
    //==========================================================

    ansi_reset_colors();

    //==========================================================
    // Курсор под интерфейс
    //==========================================================

    ansi_set_cursor(1, 26);

    return 0;
}

